#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Tue Feb 18 11:37:12 2025

add_design "D:/2L676demo/led_test/led_test/source/led_test.v"
add_constraint "D:/2L676demo/led_test/led_test/source/led_test.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module led_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/2L676demo/led_test/led_test/source/tb_led_test.v"
add_simulation "D:/2L676demo/led_test/led_test/source/led_test.v"
add_simulation "D:/2L676demo/3_2/3_2/source/tb_led_test.v"
add_simulation "F:/pds_project/2_2_1sim/2_2_sim/3_2_sim/source/testbench_signal_generator.v"
remove_simulation -force "F:/pds_project/2_2_1sim/2_2_sim/3_2_sim/source/testbench_signal_generator.v"
add_simulation "F:/pds_project/2_2_1sim/2_2_sim/3_2_sim/source/signal_generator_tb.v"
add_design "F:/pds_project/2_2_1sim/2_2_sim/3_2_sim/source/signal_analyzer_top.v"
